In [54]:
### Python Pandas Tutorials- Part 2
In Part we are going to learn about
<ol>
<li>StringIO<\li>
<li>Pandas read_csv <\li>
<\ol>

SyntaxError: invalid syntax (<ipython-input-54-d0457d229ada>, line 2)

In [46]:
### Reading Different Data sources with the help of pandas
from io import StringIO
import requests

In [2]:
import pandas as pd
df=pd.read_csv('industry.csv')

In [3]:
df

                         Industry
0              Accounting/Finance
1    Advertising/Public Relations
2              Aerospace/Aviation
3   Arts/Entertainment/Publishing
4                      Automotive
5                Banking/Mortgage
6            Business Development
7            Business Opportunity
8         Clerical/Administrative
9         Construction/Facilities
10                 Consumer Goods
11               Customer Service
12             Education/Training
13               Energy/Utilities
14                    Engineering
15            Government/Military
16                          Green
17                     Healthcare
18             Hospitality/Travel
19                Human Resources
20       Installation/Maintenance
21                      Insurance
22                       Internet
23                Job Search Aids
24       Law Enforcement/Security
25                          Legal
26           Management/Executive
27       Manufacturing/Operations
28                      Marketing
29           Non-Profit/Volunteer
30         Pharmaceutical/Biotech
31          Professional Services
32             QA/Quality Control
33                    Real Estate
34        Restaurant/Food Service
35                         Retail
36                          Sales
37               Science/Research
38                  Skilled Labor
39                     Technology
40             Telecommunications
41       Transportation/Logistics
42                          Other

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
data=('col1,col2,col3\n'
     'a,b,c\n'
     'x,y,1\n'
     '1,2,8\n')

In [7]:
type(data)

str

In [10]:
##in memeory file format object
StringIO(data)

In [14]:
pd.read_csv(StringIO(data))

  col1 col2 col3
0    a    b    c
1    x    y    1
2    1    2    8

In [18]:
pd.read_csv(StringIO(data),usecols=['col2','col3'])

  col2 col3
0    b    c
1    y    1
2    2    8

In [19]:
# convert to csv files
df.to_csv('test.csv',index=False)

In [20]:
data=('col1,col2,col3,col4\n'
     'a,b,c,d\n'
     '1,2,3,4\n'
     'w,x,y,z\n')

In [21]:
data

'col1,col2,col3,col4\na,b,c,d\n1,2,3,4\nw,x,y,z\n'

In [23]:
df=pd.read_csv(StringIO(data))

In [24]:
df

  col1 col2 col3 col4
0    a    b    c    d
1    1    2    3    4
2    w    x    y    z

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      object
 1   col2    3 non-null      object
 2   col3    3 non-null      object
 3   col4    3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [26]:
df=pd.read_csv(StringIO(data),dtype='object')

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      object
 1   col2    3 non-null      object
 2   col3    3 non-null      object
 3   col4    3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [34]:
data=('col1,col2,col3,col4\n'
     'a,b,c,d\n'
     '1,2,,4\n'
     'w,x,y\n')

In [35]:
df=pd.read_csv(StringIO(data))

In [36]:
df

  col1 col2 col3 col4
0    a    b    c    d
1    1    2  NaN    4
2    w    x    y  NaN

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      object
 1   col2    3 non-null      object
 2   col3    2 non-null      object
 3   col4    2 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [38]:
pd.read_csv(StringIO(data),index_col=0)

     col2 col3 col4
col1
a       b    c    d
1       2  NaN    4
w       x    y  NaN

In [39]:
pd.read_csv(StringIO(data),usecols=['col1','col2','col3'],index_col=0)

     col2 col3
col1
a       b    c
1       2  NaN
w       x    y